## Understand Pandas map()

In [15]:
#sample data
data = {'name': ['A', 'B', 'C', 'D', 'E'], 
        'age': [22, 26, 33, 44, 50],
        'profession' : ['data engineer', 'data scientist', 'entrepreneur', 'business analyst', 'self-employed'], 
        'city': ['Gurgaon', 'Bangalore', 'Gurgaon', 'Pune', 'New Delhi']}

df = pd.DataFrame(data)
df

  name  age        profession       city
0    A   22     data engineer    Gurgaon
1    B   26    data scientist  Bangalore
2    C   33      entrepreneur    Gurgaon
3    D   44  business analyst       Pune
4    E   50     self-employed  New Delhi

In [12]:
# dictionary to map city with states
map_city_to_states = { 'Gurgaon' : 'Haryana', 
                  'Bangalore' : 'Karnataka', 
                  'Pune' : 'Maharashtra', 
                  'New Delhi' : 'Delhi'}

In [13]:
# apply pandas map to map the city columns with states
df['state'] = df['city'].map(map_city_to_states)
df

  name  age        profession       city        state
0    A   22     data engineer    Gurgaon      Haryana
1    B   26    data scientist  Bangalore    Karnataka
2    C   33      entrepreneur    Gurgaon      Haryana
3    D   44  business analyst       Pune  Maharashtra
4    E   50     self-employed  New Delhi        Delhi